골드바흐(4, [2, 2]) :- !.
골드바흐(_엔, _엘) :- 
    _엔 mod 2 =:= 0, _엔 > 4, 
    골드바흐(_엔, _엘, 3).

골드바흐(_엔, [_피, _큐], _피) :- 
    _큐 := _엔 - _피, 
    소수인가(_큐), !.
골드바흐(_엔, _엘, _피) :- 
    _피 < _엔, 
    다음_소수(_피, _피1), 
    골드바흐(_엔, _엘, _피1).

다음_소수(_피, _피1) :- 
    _피1 := _피 + 2, 
    소수인가(_피1), !.
다음_소수(_피, _피1) :- 
    _피2 := _피 + 2, 
    다음_소수(_피2, _피1).


% List of Goldbach Compositions
골드바흐_목록(_에이, _비) :- 골드바흐_목록(_에이, _비, 2).

골드바흐_목록(_에이, _비, _엘) :- 
    _에이 =< 4, !, 
    골드바흐_리스트(4, _비, _엘).
골드바흐_목록(_에이, _비, _엘) :- 
    _에이1 := ((_에이 + 1) // 2) * 2, 
    골드바흐_리스트(_에이1, _비, _엘).

골드바흐_리스트(_에이, _비, _) :- 
    _에이 > _비, !.
골드바흐_리스트(_에이, _비, _엘) :- 
    골드바흐(_에이, [_피, _큐]),
    골드바흐_출력(_에이, _피, _큐, _엘),
    _에이2 := _에이 + 2,
    골드바흐_리스트(_에이2, _비, _엘).

골드바흐_출력(_에이, _피, _큐, _엘) :- 
    _피 >= _엘, !,
    쓰기(_에이),
    쓰기(' = '),
    쓰기(_피),
    쓰기(' + '),
    쓰기(_큐),
    nl.
골드바흐_출력(_, _, _, _).
