구성(_엘스, _티) :- 구성(_엘스, _티, 빈).

구성([], _티, _티).
구성([_엔|_엔스], _티, _티0) :- 
    추가(_엔, _티0, _티1), 
    구성(_엔스, _티, _티1).

이진트리배치3(nil,nil) :- !. 
이진트리배치3(_트,_피티) :-
  윤곽트리(_트,_씨티),
  _씨티 = t(_,_,_,_윤곽),
  최소윤곽(_윤곽,_엠씨,0),   
  _엑스루트 is 1-_엠씨,
  이진트리배치3(_씨티,_피티,_엑스루트,1).

윤곽트리(nil,nil).
윤곽트리(t(_엑스,_엘,_알),t(_엑스,_씨엘,_씨알,_윤곽)) :- 
  윤곽트리(_엘,_씨엘),
  윤곽트리(_알,_씨알),
  결합(_씨엘,_씨알,_윤곽).

결합(nil,nil,[]).
결합(t(_,_,_,_씨엘),nil,[c(-1,-1)|_씨에스]) :- 이동(_씨엘,-1,_씨에스).
결합(nil,t(_,_,_,_씨알),[c(1,1)|_씨에스]) :- 이동(_씨알,1,_씨에스).
결합(t(_,_,_,_씨엘),t(_,_,_,_씨알),[c(_디엘,_디알)|_씨에스]) :-
  최대차이(_씨엘,_씨알,_엠디,0), 
  _디알 is (_엠디+2)//2, _디엘 is -_디알,
  병합(_씨엘,_씨알,_디엘,_디알,_씨에스).

이동([],_,[]).
이동([c(_엘,_알)|_씨에스],_에스,[c(_엘에스,_알에스)|_씨에스에스]) :-
  _엘에스 is _엘+_에스, _알에스 is _알+_에스, 이동(_씨에스,_에스,_씨에스에스).

최대차이([],_,_엠디,_엠디) :- !.
최대차이(_,[],_엠디,_엠디) :- !.
최대차이([c(_,_알1)|_씨에스1],[c(_엘2,_)|_씨에스2],_엠디,_에이) :- 
  _수 is _알1-_엘2,
  최대(_에이,_수,_에이1),
  최대차이(_씨에스1,_씨에스2,_엠디,_에이1).

최대(_엑스,_와이,_엑스):- _엑스 >= _와이, !.
최대(_엑스,_와이,_와이).

병합([],_씨알,_,_디알,_씨에스) :- !, 이동(_씨알,_디알,_씨에스).
병합(_씨엘,[],_디엘,_,_씨에스) :- !, 이동(_씨엘,_디엘,_씨에스).
병합([c(_엘1,_)|_씨에스1],[c(_,_알2)|_씨에스2],_디엘,_디알,[c(_엘,_알)|_씨에스]) :-
  _엘 is _엘1+_디엘, _알 is _알2+_디알,
  병합(_씨에스1,_씨에스2,_디엘,_디알,_씨에스).

최소윤곽([],_엠씨,_엠씨).
최소윤곽([c(_엘,_)|_씨에스],_엠씨,_에이) :- 
   최소(_에이,_엘,_에이1), 
   최소윤곽(_씨에스,_엠씨,_에이1).

최소(_엑스,_와이,_엑스):- _엑스 < _와이, !.
최소(_엑스,_와이,_와이).

이진트리배치3(nil,nil,_,_).
이진트리배치3(t(_더블유,nil,nil,_),t(_더블유,_엑스,_와이,nil,nil),_엑스,_와이) :- !. 
이진트리배치3(t(_더블유,_엘,_알,[c(_디엘,_디알)|_]),t(_더블유,_엑스,_와이,_피엘,_피알),_엑스,_와이) :- 
  _와이1 is _와이 + 1,
  _엑스왼쪽 is _엑스 + _디엘,
  이진트리배치3(_엘,_피엘,_엑스왼쪽,_와이1), 
  _엑스오른쪽 is _엑스 + _디알,
  이진트리배치3(_알,_피알,_엑스오른쪽,_와이1).

?- 구성([n,k,m,c,a,e,d,g,u,p,q],_트리), 이진트리배치3(_트리,_결과).