허프만(_에프스, _씨스) :-
    초기화(_에프스, _엔스),
    나무_만들기(_엔스, _티),
    나무_순회(_티, _씨스).

초기화([], []).
초기화([fr(_에스, _에프)|_에프스], [n(_에프, _에스)|_엔스]) :-
    초기화(_에프스, _엔스).

초기화(_에프스, _엔스) :-
    초기화_도움(_에프스, _엔스_미완),
    sort(_엔스_미완, _엔스).

초기화_도움([], []).
초기화_도움([fr(_에스, _에프)|_에프스], [n(_에프, _에스)|_엔스]) :-
    초기화_도움(_에프스, _엔스).

나무_만들기([_티], _티).
나무_만들기([n(_에프1, _엑스1), n(_에프2, _엑스2)|_엔스], _티) :-
    _에프 := _에프1 + _에프2,
    삽입(n(_에프, s(n(_에프1, _엑스1), n(_에프2, _엑스2))), _엔스, _엔스_결과),
    나무_만들기(_엔스_결과, _티).

삽입(_엔, [], [_엔]) :- !.
삽입(n(_에프, _엑스), [n(_에프0, _와이)|_엔스], [n(_에프, _엑스), n(_에프0, _와이)|_엔스]) :- 
    _에프 < _에프0, !.
삽입(n(_에프, _엑스), [n(_에프0, _와이)|_엔스], [n(_에프0, _와이)|_엔스1]) :-
    _에프 >= _에프0,
    삽입(n(_에프, _엑스), _엔스, _엔스1).

나무_순회(_티, _씨스) :-
    나무_순회_도움(_티, '', _씨스_임시-[]),
    sort(_씨스_임시, _씨스).

나무_순회_도움(n(_, _에이), _코드, [hc(_에이, _코드)|_씨스]-_씨스) :- atom(_에이).
나무_순회_도움(n(_, s(_왼쪽, _오른쪽)), _코드, _씨스1-_씨스3) :-
    atom_concat(_코드, '0', _코드_왼쪽),
    atom_concat(_코드, '1', _코드_오른쪽),
    나무_순회_도움(_왼쪽, _코드_왼쪽, _씨스1-_씨스2),
    나무_순회_도움(_오른쪽, _코드_오른쪽, _씨스2-_씨스3).
