트리_문자열(_트,_에스) :- nonvar(_트), 트리_차분목록(_트,_엘-[]), !, atom_chars(_에스,_엘).
트리_문자열(_트,_에스) :- nonvar(_에스), atom_chars(_에스,_엘), 트리_차분목록(_트,_엘-[]).


트리_차분목록(nil,_엘-_엘).
트리_차분목록(t(_엑스,nil,nil),_엘1-_엘2) :- 
   문자(_엑스,_엘1-_엘2).
트리_차분목록(t(_엑스,_왼쪽,_오른쪽),_엘1-_엘7) :- 
   문자(_엑스,_엘1-_엘2), 
   기호('(',_엘2-_엘3),
   트리_차분목록(_왼쪽,_엘3-_엘4),
   기호(',',_엘4-_엘5),
   트리_차분목록(_오른쪽,_엘5-_엘6),
   기호(')',_엘6-_엘7).

기호(_엑스,[_엑스|_엑스에스]-_엑스에스).

문자(_엑스,_엘1-_엘2) :- 기호(_엑스,_엘1-_엘2).

?- 트리_문자열(t(a,t(b,nil,nil),t(c,nil,nil)),_결과).